In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
In [10]: df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
....: 'key2' : ['one', 'two', 'one', 'two', 'one'],
....: 'data1' : np.random.randn(5),
....: 'data2' : np.random.randn(5)})

In [4]:
df

      data1     data2 key1 key2
0  0.554373 -0.287962    a  one
1 -0.911964  0.315323    a  two
2 -1.203580 -1.760443    b  one
3  0.299927  2.560293    b  two
4  1.218899  0.236114    a  one

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a    0.287103
b   -0.451826
Name: data1, dtype: float64

In [13]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [14]:
means

key1  key2
a     one     0.886636
      two    -0.911964
b     one    -1.203580
      two     0.299927
Name: data1, dtype: float64

In [15]:
means.unstack()

key2       one       two
key1
a     0.886636 -0.911964
b    -1.203580  0.299927

In [16]:
In [18]: states = np.array(['Ohio', 'California', 'California', 'Ohio',
'Ohio'])
In [19]: years = np.array([2005, 2005, 2006, 2005, 2006])

In [17]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [18]:
df.data1.groupby([states,years]).sum()

California  2005   -0.911964
            2006   -1.203580
Ohio        2005    0.854300
            2006    1.218899
Name: data1, dtype: float64

In [19]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.287103  0.087825
b    -0.451826  0.399925

In [20]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.886636 -0.025924
     two  -0.911964  0.315323
b    one  -1.203580 -1.760443
     two   0.299927  2.560293

In [21]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [22]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  0.554373 -0.287962    a  one
1 -0.911964  0.315323    a  two
4  1.218899  0.236114    a  one
b
      data1     data2 key1 key2
2 -1.203580 -1.760443    b  one
3  0.299927  2.560293    b  two

In [23]:
for name,group in df.groupby(['key1','key2']):
    print(name)
    print(group)

('a', 'one')
      data1     data2 key1 key2
0  0.554373 -0.287962    a  one
4  1.218899  0.236114    a  one
('a', 'two')
      data1     data2 key1 key2
1 -0.911964  0.315323    a  two
('b', 'one')
     data1     data2 key1 key2
2 -1.20358 -1.760443    b  one
('b', 'two')
      data1     data2 key1 key2
3  0.299927  2.560293    b  two

In [24]:
pieces = dict(list(df.groupby('key1')))

In [25]:
pieces['b']

      data1     data2 key1 key2
2 -1.203580 -1.760443    b  one
3  0.299927  2.560293    b  two

In [26]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [27]:
grouped = df.groupby(df.dtypes,axis=1)

In [29]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.554373 -0.287962
1 -0.911964  0.315323
2 -1.203580 -1.760443
3  0.299927  2.560293
4  1.218899  0.236114
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [30]:
df.groupby('key1')['data1']

In [31]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.025924
     two   0.315323
b    one  -1.760443
     two   2.560293

In [32]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [33]:
s_grouped

In [34]:
s_grouped.mean()

key1  key2
a     one    -0.025924
      two     0.315323
b     one    -1.760443
      two     2.560293
Name: data2, dtype: float64

In [35]:
In [35]: people = pd.DataFrame(np.random.randn(5, 5),
....: columns=['a', 'b', 'c', 'd', 'e'],
....: index=['Joe', 'Steve', 'Wes', 'Jim',
'Travis'])
In [36]: people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
In [37]: people

               a         b         c         d         e
Joe     0.228064  1.592918 -1.371554  0.274566  0.162096
Steve  -0.602570  0.836633  1.170803  1.016493 -0.200838
Wes     0.709385       NaN       NaN  0.432945  0.015160
Jim    -1.468403 -2.071582  0.233385  0.795268  0.555620
Travis  1.479975  1.749793  2.291599 -0.095310  0.834088

In [36]:
In [38]: mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
....: 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [37]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [38]:
by_column = people.groupby(mapping,axis=1)

In [39]:
by_column.sum()

            blue       red
Joe    -1.096988  1.983077
Steve   2.187296  0.033225
Wes     0.432945  0.724546
Jim     1.028654 -2.984365
Travis  2.196289  4.063856

In [40]:
map_series = pd.Series(mapping)

In [41]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [42]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [43]:
people

               a         b         c         d         e
Joe     0.228064  1.592918 -1.371554  0.274566  0.162096
Steve  -0.602570  0.836633  1.170803  1.016493 -0.200838
Wes     0.709385       NaN       NaN  0.432945  0.015160
Jim    -1.468403 -2.071582  0.233385  0.795268  0.555620
Travis  1.479975  1.749793  2.291599 -0.095310  0.834088

In [44]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.530954 -0.478664 -1.138169  1.502779  0.732877
5 -0.602570  0.836633  1.170803  1.016493 -0.200838
6  1.479975  1.749793  2.291599 -0.095310  0.834088

In [45]:
people.groupby(lambda x: x[-1]).sum()

          a         b         c         d         e
e -0.374506  2.429551 -0.200751  1.291059 -0.038742
m -1.468403 -2.071582  0.233385  0.795268  0.555620
s  2.189360  1.749793  2.291599  0.337635  0.849249

In [46]:
 key_list = ['one', 'one', 'one', 'two', 'two']

In [47]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one  0.228064  1.592918 -1.371554  0.274566  0.015160
  two -1.468403 -2.071582  0.233385  0.795268  0.555620
5 one -0.602570  0.836633  1.170803  1.016493 -0.200838
6 two  1.479975  1.749793  2.291599 -0.095310  0.834088

In [48]:
In [47]: columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP',
'JP'],
....: [1, 3, 5, 1, 3]],
....: names=['cty', 'tenor'])
In [48]: hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [49]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.401821  0.671074 -0.057992  1.685946  0.132040
1      1.208252  0.867373  0.436066 -0.271943 -0.957871
2     -0.519773  0.941798 -0.123998 -0.823062  0.340399
3     -1.569490  1.163800 -1.230854  1.740729  0.327270

In [50]:
hier_df.groupby(level=0,axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [51]:
df

      data1     data2 key1 key2
0  0.554373 -0.287962    a  one
1 -0.911964  0.315323    a  two
2 -1.203580 -1.760443    b  one
3  0.299927  2.560293    b  two
4  1.218899  0.236114    a  one

In [52]:
grouped = df.groupby('key1')

In [57]:
grouped.data1.quantile([i/10 for i in range(1,10)])

key1
a     0.1   -0.618696
      0.2   -0.325429
      0.3   -0.032162
      0.4    0.261106
      0.5    0.554373
      0.6    0.687278
      0.7    0.820183
      0.8    0.953089
      0.9    1.085994
b     0.1   -1.053229
      0.2   -0.902879
      0.3   -0.752528
      0.4   -0.602177
      0.5   -0.451826
      0.6   -0.301476
      0.7   -0.151125
      0.8   -0.000774
      0.9    0.149576
Name: data1, dtype: float64

In [58]:
def peak2peak(arr):
    return arr.max()-arr.min()

In [59]:
grouped.agg(peak2peak)

         data1     data2
key1
a     2.130863  0.603286
b     1.503507  4.320737

In [60]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.287103  1.090284 -0.911964 -0.178795  0.554373  0.886636
b      2.0 -0.451826  1.063140 -1.203580 -0.827703 -0.451826 -0.075950

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.218899   3.0  0.087825  0.327842 -0.287962 -0.025924  0.236114
b     0.299927   2.0  0.399925  3.055222 -1.760443 -0.680259  0.399925


           75%       max
key1
a     0.275719  0.315323
b     1.480109  2.560293

In [61]:
In [57]: tips = pd.read_csv('examples/tips.csv')
# Add tip percentage of total bill
In [58]: tips['tip_pct'] = tips['tip'] / tips['total_bill']
In [59]: tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [62]:
grouped = tips.groupby(['day','smoker'])

In [63]:
grouped_pct = grouped['tip_pct']

In [64]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [65]:
grouped_pct.agg(['mean','std',peak2peak])

                 mean       std  peak2peak
day  smoker
Fri  No      0.151650  0.028123   0.067349
     Yes     0.174783  0.051293   0.159925
Sat  No      0.158048  0.039767   0.235193
     Yes     0.147906  0.061375   0.290095
Sun  No      0.160113  0.042347   0.193226
     Yes     0.187250  0.154134   0.644685
Thur No      0.160298  0.038774   0.193350
     Yes     0.163863  0.039389   0.151240

In [66]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [67]:
functionss = ['count','mean','max']

In [68]:
result = grouped['tip_pct','total_bill'].agg(functionss)

In [69]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [70]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [71]:
ftuples = [('Durch','mean'),('Abwei',np.var)]

In [72]:
grouped['tip_pct','total_bill'].agg(ftuples)

              tip_pct           total_bill
                Durch     Abwei      Durch       Abwei
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [73]:
grouped.agg({'tip':np.max,'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [74]:
grouped.agg(dict(tip_pct=['min','max','mean','std'],size='sum'))

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [75]:
tips.groupby(['day','smoker'],as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [78]:
def top(df:pd.DataFrame,n=5,column='tip_pct'):
    return df.sort_values(by=column,ascending=False)[:n]

In [79]:
top(tips,6)

     total_bill   tip smoker  day    time  size   tip_pct
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
232       11.61  3.39     No  Sat  Dinner     2  0.291990
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525

In [85]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39     No   Sat  Dinner     2  0.291990
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [86]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [87]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [88]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [89]:
result.unstack()

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [94]:
tips.groupby('smoker',group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
232       11.61  3.39     No   Sat  Dinner     2  0.291990
149        7.51  2.00     No  Thur   Lunch     2  0.266312
51        10.29  2.60     No   Sun  Dinner     2  0.252672
185       20.69  5.00     No   Sun  Dinner     5  0.241663
88        24.71  5.85     No  Thur   Lunch     2  0.236746
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [95]:
In [82]: frame = pd.DataFrame({'data1': np.random.randn(1000),
....: 'data2': np.random.randn(1000)})

In [99]:
quartiles = pd.cut(frame.data1,4,labels=list('ABCD'))

In [100]:
quartiles[:10]

0    D
1    C
2    B
3    C
4    C
5    B
6    C
7    C
8    C
9    C
Name: data1, dtype: category
Categories (4, object): [A < B < C < D]

In [102]:
In [85]: def get_stats(group):
....:     return {'min': group.min(), 'max': group.max(),
....: 'count': group.count(), 'mean': group.mean()}

In [103]:
grouped = frame.data2.groupby(quartiles)

In [104]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
A       74.0  2.577720  0.063620 -2.354825
B      495.0  3.962488 -0.016237 -2.708933
C      386.0  3.224489  0.034423 -2.669906
D       45.0  2.510735  0.160194 -3.053462

In [105]:
grouping = pd.qcut(frame.data1,10,labels=False)

In [106]:
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.577720  0.051775 -2.354825
1      100.0  2.424165  0.083315 -2.458991
2      100.0  3.962488 -0.073071 -2.708933
3      100.0  2.649126 -0.012143 -2.425769
4      100.0  2.459466 -0.068484 -2.510648
5      100.0  2.785451  0.041796 -2.442759
6      100.0  3.224489  0.065130 -2.669906
7      100.0  2.933665 -0.123154 -2.162822
8      100.0  2.458618  0.080460 -2.487287
9      100.0  2.712277  0.126042 -3.053462

In [107]:
In [91]: s = pd.Series(np.random.randn(6))
In [92]: s[::2] = np.nan

In [108]:
s

0         NaN
1   -0.898817
2         NaN
3    1.174494
4         NaN
5    0.399335
dtype: float64

In [109]:
s.fillna(s.mean())

0    0.225004
1   -0.898817
2    0.225004
3    1.174494
4    0.225004
5    0.399335
dtype: float64

In [110]:
In [95]: states = ['Ohio', 'New York', 'Vermont', 'Florida',
....: 'Oregon', 'Nevada', 'California', 'Idaho']
In [96]: group_key = ['East'] * 4 + ['West'] * 4

In [111]:
In [97]: data = pd.Series(np.random.randn(8), index=states)

In [112]:
data

Ohio         -0.030390
New York     -0.315399
Vermont      -0.528030
Florida      -0.970926
Oregon       -2.404301
Nevada       -0.464205
California   -0.185434
Idaho         0.802551
dtype: float64

In [113]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [114]:
data

Ohio         -0.030390
New York     -0.315399
Vermont            NaN
Florida      -0.970926
Oregon       -2.404301
Nevada             NaN
California   -0.185434
Idaho              NaN
dtype: float64

In [115]:
data.groupby(group_key).mean()

East   -0.438905
West   -1.294868
dtype: float64

In [116]:
fill_mean = lambda g:g.fillna(g.mean())

In [117]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.030390
New York     -0.315399
Vermont      -0.438905
Florida      -0.970926
Oregon       -2.404301
Nevada       -1.294868
California   -0.185434
Idaho        -1.294868
dtype: float64

In [118]:
fill_values = {'East':0.5,'West':-1}

In [119]:
fill_func = lambda g:g.fillna(fill_values[g.name])

In [120]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.030390
New York     -0.315399
Vermont       0.500000
Florida      -0.970926
Oregon       -2.404301
Nevada       -1.000000
California   -0.185434
Idaho        -1.000000
dtype: float64

In [121]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']

In [122]:
cards=[]

In [123]:
for suit in suits:
    cards.extend(str(num)+suit for num in base_names)

In [124]:
cards

['AH',
 '2H',
 '3H',
 '4H',
 '5H',
 '6H',
 '7H',
 '8H',
 '9H',
 '10H',
 'JH',
 'KH',
 'QH',
 'AS',
 '2S',
 '3S',
 '4S',
 '5S',
 '6S',
 '7S',
 '8S',
 '9S',
 '10S',
 'JS',
 'KS',
 'QS',
 'AC',
 '2C',
 '3C',
 '4C',
 '5C',
 '6C',
 '7C',
 '8C',
 '9C',
 '10C',
 'JC',
 'KC',
 'QC',
 'AD',
 '2D',
 '3D',
 '4D',
 '5D',
 '6D',
 '7D',
 '8D',
 '9D',
 '10D',
 'JD',
 'KD',
 'QD']

In [125]:
deck = pd.Series(card_val,index=cards)

In [126]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [127]:
def draw(deck,n=5):
    return deck.sample(n)

In [128]:
draw(deck)

7C      7
10S    10
10C    10
JH     10
7S      7
dtype: int64

In [129]:
get_suit = lambda card:card[-1]

In [130]:
deck.groupby(get_suit).apply(draw,n=2)

C  8C     8
   4C     4
D  JD    10
   9D     9
H  9H     9
   6H     6
S  4S     4
   9S     9
dtype: int64

In [131]:
In [114]: df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
.....: 'b', 'b', 'b', 'b'],
.....: 'data': np.random.randn(8),
.....: 'weights': np.random.rand(8)})

In [132]:
df

  category      data   weights
0        a  0.719916  0.738588
1        a -0.143945  0.743668
2        a -0.772511  0.757915
3        a  0.544861  0.813104
4        b  0.172390  0.981232
5        b  0.200872  0.290250
6        b  0.103508  0.863467
7        b -0.405674  0.317384

In [133]:
grouped = df.groupby('category')

In [137]:
get_wavg = lambda g:np.average(g['data'],weights=g['weights'])

In [138]:
grouped.apply(get_wavg)

category
a    0.092427
b    0.076694
dtype: float64

In [139]:
In [119]: close_px = pd.read_csv('examples/stock_px_2.csv',
parse_dates=True,
.....: index_col=0)
In [120]: close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB